IamfromSpace/stm32f3xx-hal/src/pwm.rs
        pwm_channel3_pin!(TIM4, TIM4_CH3, output_to_pd14, PD14, AF2);

        pwm_channel4_pin!(TIM4, TIM4_CH4, output_to_pd15, PD15, AF2);
        pwm_channel4_pin!(TIM4, TIM4_CH4, output_to_pf6, PF6, AF2);
    };
}

#[cfg(any(
    feature = "stm32f302",
    feature = "stm32f303",
    feature = "stm32f373",
    feature = "stm32f378",
    feature = "stm32f358",
    feature = "stm32f398"
))]
tim4_common!();

#[cfg(any(
    feature = "stm32f302",
    feature = "stm32f303xb",
    feature = "stm32f303xc",
    feature = "stm32f303xd",
    feature = "stm32f303xe",
    feature = "stm32f373",
    feature = "stm32f378",
    feature = "stm32f358",
    feature = "stm32f398"
))]
tim4_ext!();

// TIM5

#[cfg(feature = "stm32f373")]
macro_rules! tim5 {
    () => {
        use crate::pac::TIM5;

        /// Output Compare Channel 1 of Timer 5 (type state)
        pub struct TIM5_CH1 {}
        /// Output Compare Channel 2 of Timer 5 (type state)
        pub struct TIM5_CH2 {}
        /// Output Compare Channel 3 of Timer 5 (type state)
        pub struct TIM5_CH3 {}
        /// Output Compare Channel 4 of Timer 5 (type state)
        pub struct TIM5_CH4 {}

        pwm_timer_basic!(
            tim5,
            TIM5,
            u32,
            apb1enr,
            apb1rstr,
            pclk1,
            tim5rst,
            tim5en,
            [TIM5_CH1, TIM5_CH2, TIM5_CH3, TIM5_CH4],
            [PwmChannel, PwmChannel, PwmChannel, PwmChannel]
        );

        // Channels
        pwm_pin_for_pwm_channel!(TIM5, TIM5_CH1, u32, cc1e, ccr1, ccr);
        pwm_pin_for_pwm_channel!(TIM5, TIM5_CH2, u32, cc2e, ccr2, ccr);
        pwm_pin_for_pwm_channel!(TIM5, TIM5_CH3, u32, cc3e, ccr3, ccr);
        pwm_pin_for_pwm_channel!(TIM5, TIM5_CH4, u32, cc4e, ccr4, ccr);

        // Pins
        pwm_channel1_pin!(TIM5, TIM5_CH1, output_to_pa0, PA0, AF2);
        pwm_channel1_pin!(TIM5, TIM5_CH1, output_to_pa8, PA8, AF2);
        pwm_channel1_pin!(TIM5, TIM5_CH1, output_to_pc0, PC0, AF2);

        pwm_channel2_pin!(TIM5, TIM5_CH2, output_to_pa1, PA1, AF2);
        pwm_channel2_pin!(TIM5, TIM5_CH2, output_to_pa11, PA11, AF2);
        pwm_channel2_pin!(TIM5, TIM5_CH2, output_to_pc1, PC1, AF2);

        pwm_channel3_pin!(TIM5, TIM5_CH3, output_to_pa2, PA2, AF2);
        pwm_channel3_pin!(TIM5, TIM5_CH3, output_to_pa12, PA12, AF2);
        pwm_channel3_pin!(TIM5, TIM5_CH3, output_to_pc2, PC2, AF2);

        pwm_channel4_pin!(TIM5, TIM5_CH4, output_to_pa3, PA3, AF2);
        pwm_channel4_pin!(TIM5, TIM5_CH4, output_to_pa13, PA13, AF2);
        pwm_channel4_pin!(TIM5, TIM5_CH4, output_to_pc3, PC3, AF2);
    };
}

// TODO: This timer is also present in stm32f378
#[cfg(any(feature = "stm32f373"))]
tim5!();

// TIM8

#[cfg(any(feature = "stm32f303", feature = "stm32f358", feature = "stm32f398"))]
macro_rules! tim8 {
    () => {
        use crate::pac::TIM8;

        /// Output Compare Channel 1 of Timer 8 (type state)
        pub struct TIM8_CH1 {}
        /// Output Compare Channel 2 of Timer 8 (type state)
        pub struct TIM8_CH2 {}
        /// Output Compare Channel 3 of Timer 8 (type state)
        pub struct TIM8_CH3 {}
        /// Output Compare Channel 4 of Timer 8 (type state)
        pub struct TIM8_CH4 {}

        pwm_timer_with_break!(
            tim8,
            TIM8,
            u16,
            apb2enr,
            apb2rstr,
            pclk2,
            tim8rst,
            tim8en,
            [TIM8_CH1, TIM8_CH2, TIM8_CH3, TIM8_CH4],
            [PwmChannel, PwmChannel, PwmChannel, PwmChannel]
        );

        // Channels
        pwm_pin_for_pwm_n_channel!(TIM8, TIM8_CH1, u16, cc1e, cc1ne, ccr1, ccr);
        pwm_pin_for_pwm_n_channel!(TIM8, TIM8_CH2, u16, cc2e, cc2ne, ccr2, ccr);
        pwm_pin_for_pwm_n_channel!(TIM8, TIM8_CH3, u16, cc3e, cc3ne, ccr3, ccr);
        pwm_pin_for_pwm_channel!(TIM8, TIM8_CH4, u16, cc4e, ccr4, ccr);

        //Pins
        pwm_channel1_pin!(TIM8, TIM8_CH1, output_to_pa15, PA15, AF2);
        pwm_channel1_pin!(TIM8, TIM8_CH1, output_to_pb6, PB6, AF2);
        pwm_channel1_pin!(TIM8, TIM8_CH1, output_to_pc6, PC6, AF4);

        pwm_channel1n_pin!(TIM8, TIM8_CH1, output_to_pa7, PA7, AF4);
        pwm_channel1n_pin!(TIM8, TIM8_CH1, output_to_pb3, PB3, AF4);
        pwm_channel1n_pin!(TIM8, TIM8_CH1, output_to_pc10, PC10, AF4);

        pwm_channel2_pin!(TIM8, TIM8_CH2, output_to_pa14, PA14, AF5);
        pwm_channel2_pin!(TIM8, TIM8_CH2, output_to_pb8, PB8, AF10);
        pwm_channel2_pin!(TIM8, TIM8_CH2, output_to_pc7, PC7, AF4);

        pwm_channel2n_pin!(TIM8, TIM8_CH2, output_to_pb0, PB0, AF4);
        pwm_channel2n_pin!(TIM8, TIM8_CH2, output_to_pb4, PB4, AF4);
        pwm_channel2n_pin!(TIM8, TIM8_CH2, output_to_pc11, PC11, AF4);

        pwm_channel3_pin!(TIM8, TIM8_CH3, output_to_pb9, PB9, AF10);
        pwm_channel3_pin!(TIM8, TIM8_CH3, output_to_pc8, PC8, AF4);

        pwm_channel3n_pin!(TIM8, TIM8_CH3, output_to_pb1, PB1, AF4);
        pwm_channel3n_pin!(TIM8, TIM8_CH3, output_to_pb5, PB5, AF3);
        pwm_channel3n_pin!(TIM8, TIM8_CH3, output_to_pc12, PC12, AF4);

        pwm_channel4_pin!(TIM8, TIM8_CH4, output_to_pc9, PC9, AF4);
    };
}

#[cfg(any(feature = "stm32f303", feature = "stm32f358", feature = "stm32f398"))]
tim8!();

#[cfg(any(
    feature = "stm32f303xb",
    feature = "stm32f303xc",
    feature = "stm32f303xd",
    feature = "stm32f303xe",
    feature = "stm32f358",
    feature = "stm32f398"
))]
pwm_channel4_pin!(TIM8, TIM8_CH4, output_to_pd1, PD1, AF4);

// TIM12

#[cfg(feature = "stm32f373")]
macro_rules! tim12 {
    () => {
        use crate::pac::TIM12;

        /// Output Compare Channel 1 of Timer 12 (type state)
        pub struct TIM12_CH1 {}
        /// Output Compare Channel 2 of Timer 12 (type state)
        pub struct TIM12_CH2 {}
        /// Output Compare Channel 3 of Timer 12 (type state)
        pub struct TIM12_CH3 {}
        /// Output Compare Channel 4 of Timer 12 (type state)
        pub struct TIM12_CH4 {}

        pwm_timer_basic!(
            tim12,
            TIM12,
            u16,
            apb1enr,
            apb1rstr,
            pclk1,
            tim12rst,
            tim12en,
            [TIM12_CH1, TIM12_CH2],
            [PwmChannel, PwmChannel]
        );

        // Channels
        pwm_pin_for_pwm_channel!(TIM12, TIM12_CH1, u16, cc1e, ccr1, ccr);
        pwm_pin_for_pwm_channel!(TIM12, TIM12_CH2, u16, cc2e, ccr2, ccr);

        // Pins
        pwm_channel1_pin!(TIM12, TIM12_CH1, output_to_pa4, PA4, AF10);
        pwm_channel1_pin!(TIM12, TIM12_CH1, output_to_pa14, PA14, AF10);
        pwm_channel1_pin!(TIM12, TIM12_CH1, output_to_pb14, PB14, AF10);

        pwm_channel2_pin!(TIM12, TIM12_CH2, output_to_pa5, PA5, AF10);
        pwm_channel2_pin!(TIM12, TIM12_CH2, output_to_pa15, PA15, AF10);
        pwm_channel2_pin!(TIM12, TIM12_CH2, output_to_pb15, PB15, AF10);
    };
}

// TODO: This timer is also present in stm32f378
#[cfg(feature = "stm32f373")]
tim12!();

// TIM13

