IamfromSpace/stm32f3xx-hal/src/pwm.rs
        pwm_channel3_pin!(TIM19, TIM19_CH3, output_to_pa2, PA2, AF11);
        pwm_channel3_pin!(TIM19, TIM19_CH3, output_to_pb8, PB8, AF11);
        pwm_channel3_pin!(TIM19, TIM19_CH3, output_to_pc12, PC12, AF2);

        pwm_channel4_pin!(TIM19, TIM19_CH4, output_to_pa3, PA3, AF11);
        pwm_channel4_pin!(TIM19, TIM19_CH4, output_to_pb9, PB9, AF11);
        pwm_channel4_pin!(TIM19, TIM19_CH4, output_to_pd0, PD0, AF2);
    };
}

// TODO: This timer is also present in stm32f378
#[cfg(feature = "stm32f373")]
tim19!();

// TIM20
//
#[cfg(feature = "stm32f398")]
macro_rules! tim20 {
    () => {
        use crate::pac::TIM20;

        /// Output Compare Channel 1 of Timer 20 (type state)
        pub struct TIM20_CH1 {}
        /// Output Compare Channel 2 of Timer 20 (type state)
        pub struct TIM20_CH2 {}
        /// Output Compare Channel 3 of Timer 20 (type state)
        pub struct TIM20_CH3 {}
        /// Output Compare Channel 4 of Timer 20 (type state)
        pub struct TIM20_CH4 {}

        pwm_timer_basic!(
            tim20,
            TIM20,
            u16,
            apb2enr,
            apb2rstr,
            pclk2,
            tim20rst,
            tim20en,
            [TIM20_CH1, TIM20_CH2, TIM20_CH3, TIM20_CH4],
            [PwmChannel, PwmChannel, PwmChannel, PwmChannel]
        );

        // Channels
        // TODO: stm32f3 doesn't suppport registers for all 4 channels
        pwm_pin_for_pwm_n_channel!(TIM20, TIM20_CH1, u16, cc1e, cc1ne, ccr1, ccr1);

        //Pins
        pwm_channel1_pin!(TIM20, TIM20_CH1, output_to_pe2, PE2, AF6);

        pwm_channel1n_pin!(TIM20, TIM20_CH1, output_to_pe4, PE4, AF6);
    };
}

#[cfg(feature = "stm32f398")]
tim20!();
